let mainArr = [
    //Stick
    [
        [0,1],
        [0,2],
        [0,3],
    //поворот на 90 градусов    
        [
            [-1,1],
            [0,0],
            [1,-1],
            [2,-2],
        ],
        //поворот на 270 градусов 
        [
            [1,-1],
            [0,0],
            [-1,1],
            [-2,2],
        ],
        [
            [-1,1],
            [0,0],
            [1,-1],
            [2,-2],
        ],
        //поворот на 360 градусов 
        [
            [1,-1],
            [0,0],
            [-1,1],
            [-2,2],
        ],
    ],
    //square
    [
        [1,0],
        [0,1],
        [1,1],
        //поворот на 90 градусов
        [
            [0,0],
            [0,0],
            [0,0],
            [0,0],
        ],
        //поворот на 180 градусов 
        [
            [0,0],
            [0,0],
            [0,0],
            [0,0],
        ],
        //поворот на 270 градусов 
        [
            [0,0],
            [0,0],
            [0,0],
            [0,0],
        ],
        //поворот на 360 градусов 
        [
            [0,0],
            [0,0],
            [0,0],
            [0,0],
        ],
    ],
    // L figure
    [
        [1,0],
        [0,1],
        [0,2],
         //поворот на 90 градусов
        [
            [0, 0],
            [-1,1],
            [1, 0],
            [2,-1],
        ],
        //поворот на 180 градусов 
        [
            [1,-1],
            [1,-1],
            [-1,0],
            [-1,0],
        ],
         //поворот на 270 градусов 
         [
            [-1,0],
            [0,-1],
            [2,-2],
            [1,-1],
        ],
         //поворот на 360 градусов 
         [
            [0,-1],
            [0,-1],
            [-2,0],
            [-2,0],
        ],
    ],
    // L reverse
    [
        [1,0],
        [1,1],
        [1,2],
          //поворот на 90 градусов
          [
            [0,0],
            [0,0],
            [1,-1],
            [-1,-1],
        ],
        //поворот на 180 градусов 
        [
            [0,-1],
            [-1,0],
            [-2,1],
            [1,0],
        ],
         //поворот на 270 градусов 
         [
            [2,0],
            [0,0],
            [1,-1],
            [1,-1],
        ],
         //поворот на 360 градусов 
         [
            [-2,0],
            [1,-1],
            [0,0],
            [-1,1],
        ],
    ],
    // Z figure
    [
        [1,0],
        [1,1],
        [2,1],
            //поворот на 90 градусов
            [
                [2,-1],
                [0,0],
                [1,-1],
                [-1,0],
            ],
            //поворот на 180 градусов 
            [
                [-2,0],
                [0,-1],
                [-1,0],
                [1,-1],
            ],
             //поворот на 270 градусов 
             [
                [2,-1],
                [0,0],
                [1,-1],
                [-1,0],
            ],
             //поворот на 360 градусов 
             [
                [-2,0],
                [0,-1],
                [-1,0],
                [1,-1],
            ],
    ],
    // Z reverse
    [
        [1,0],
        [-1,1],
        [0,1],
            //поворот на 90 градусов
            [
                [0,-1],
                [-1,0],
                [2,-1],
                [1,0],
            ],
            //поворот на 180 градусов 
            [
                [0,0],
                [1,-1],
                [-2,0],
                [-1,-1],
            ],
             //поворот на 270 градусов 
             [
                [0,-1],
                [-1,0],
                [2,-1],
                [1,0],
            ],
             //поворот на 360 градусов 
             [
                [0,0],
                [1,-1],
                [-2,0],
                [-1,-1],
            ],
    ],
    // T figure
    [
        [1,0],
        [2,0],
        [1,1],
            //поворот на 90 градусов
            [
                [1,-1],
                [0,0],
                [0,0],
                [0,0],
            ],
            //поворот на 180 градусов 
            [
                [0,0],
                [-1,0],
                [-1,0],
                [1,-1],
            ],
             //поворот на 270 градусов 
             [
                [1,-1],
                [1,-1],
                [1,-1],
                [0,0],
            ],
             //поворот на 360 градусов 
             [
                [-2,0],
                [0,-1],
                [0,-1],
                [-1,-1],
            ],
    ],

];

export default mainArr;